; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image3 - mode
	thermograph0 - mode
	infrared2 - mode
	image1 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star3 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(have_image Phenomenon9 thermograph0)
	(have_image Phenomenon10 thermograph0)
	(have_image Star11 thermograph0)
	(have_image Phenomenon12 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation6 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 groundstation6)
   goals met: 1 of 5
3. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 1 of 5
4. (turn_to satellite0 phenomenon10 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon10)
   goals met: 0 of 5
5. (take_image satellite0 phenomenon10 instrument0 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 1 of 5
6. (turn_to satellite0 groundstation6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation6)
   goals met: 2 of 5
7. (turn_to satellite0 phenomenon12 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 5
8. (take_image satellite0 phenomenon12 instrument0 image1)
   added: (have_image phenomenon12 image1)
   goals met: 2 of 5
9. (turn_to satellite0 groundstation6 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation6)
   goals met: 3 of 5
10. (turn_to satellite0 phenomenon9 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 5
11. (take_image satellite0 phenomenon9 instrument0 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 3 of 5
12. (turn_to satellite0 groundstation6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation6)
   goals met: 4 of 5
13. (turn_to satellite0 star11 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star11)
   goals met: 3 of 5
14. (take_image satellite0 star11 instrument0 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 4 of 5
15. (turn_to satellite0 groundstation6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation6)
   goals met: 5 of 5
